var canvas = document.getElementById('canvas'),
	 ctx = canvas.getContext('2d');

// Set to size of browser
canvas.width = window.innerWidth;
canvas.height = window.innerHeight;

var centerX = canvas.width/2,
	 centerY = canvas.height/2;

var kanji = [],
	colors = randomColors(9),
	totalKanji = randomNumber(700, 1000);

function randomColors(numberOfColors){
	var colors = [];

	var set;

	for (var i = numberOfColors - 1; i >= 0; i--) {
		 var set = (Math.floor(Math.random() * 256)) + ',' + (Math.floor(Math.random() * 256)) + ',' + (Math.floor(Math.random() * 256));
		 colors.push(set);
	};
	
	return colors;
}



for (var i = 0; i < totalKanji; i++) {
	
	var p = Math.random(),
		 x = centerX,
		 y = centerY;
	
		 
	var k = new Kanji(i,totalKanji,x,y,colors[Math.floor(i%colors.length)], randomNumber(6, 21), randomNumber(0.6, 1));

	k.innerX = x;
   	k.innerY = y;

   	kanji.push(k);
	
}

// Draw kanji
function Kanji(i, totalKanji, x, y, color, size, alpha) {
	
	var _this = this;
	
	_this.x = x || null;
	_this.y = y || null;
	_this.color = color || null;
	_this.size = size || null;
	_this.alpha = alpha || null;
	

	
	var l = new Array("一","右","雨","円","王","音","下","火","花","貝","学","気","九","休","玉","金","空","月","犬","見","五","口","校","左","三","山","子","四","糸","字","耳","七","車","手","十","出","女","小","上","森","人","水","正","生","青","夕","石","赤","千","川","先","早","草","足","村","大","男","竹","中","虫","町","天","田","土","二","日","入","年","白","八","百","文","木","本","名","目","立","力","林","六","引","羽","雲","園","遠","何","科","夏","家","歌","画","回","会","海","絵","外","角","楽","活","間","丸","岩","顔","汽","記","帰","弓","牛","魚","京","強","教","近","兄","形","計","元","言","原","戸","古","午","後","語","工","公","広","交","光","考","行","高","黄","合","谷","国","黒","今","才","細","作","算","止","市","矢","姉","思","紙","寺","自","時","室","社","弱","首","秋","週","春","書","少","場","色","食","心","新","親","図","数","西","声","星","晴","切","雪","船","線","前","組","走","多","太","体","台","地","池","知","茶","昼","長","鳥","朝","直","通","弟","店","点","電","刀","冬","当","東","答","頭","同","道","読","内","南","肉","馬","売","買","麦","半","番","父","風","分","聞","米","歩","母","方","北","毎","妹","万","明","鳴","毛","門","夜","野","友","用","曜","来","里","理","話","悪","安","暗","医","委","意","育","員","院","飲","運","泳","駅","央","横","屋","温","化","荷","界","開","階","寒","感","漢","館","岸","起","期","客","究","急","級","宮","球","去","橋","業","曲","局","銀","区","苦","具","君","係","軽","血","決","研","県","庫","湖","向","幸","港","号","根","祭","皿","仕","死","使","始","指","歯","詩","次","事","持","式","実","写","者","主","守","取","酒","受","州","拾","終","習","集","住","重","宿","所","暑","助","昭","消","商","章","勝","乗","植","申","身","神","真","深","進","世","整","昔","全","相","送","想","息","速","族","他","打","対","待","代","第","題","炭","短","談","着","注","柱","丁","帳","調","追","定","庭","笛","鉄","転","都","度","投","豆","島","湯","登","等","動","童","農","波","配","倍","箱","畑","発","反","坂","板","皮","悲","美","鼻","筆","氷","表","秒","病","品","負","部","服","福","物","平","返","勉","放","味","命","面","問","役","薬","由","油","有","遊","予","羊","洋","葉","陽","様","落","流","旅","両","緑","礼","列","練","路","和","愛","案","以","衣","位","囲","胃","印","英","栄","塩","億","加","果","貨","課","芽","改","械","害","街","各","覚","完","官","管","関","観","願","希","季","紀","喜","旗","器","機","議","求","泣","救","給","挙","漁","共","協","鏡","競","極","訓","軍","郡","径","型","景","芸","欠","結","建","健","験","固","功","好","候","航","康","告","差","菜","最","材","昨","札","刷","殺","察","参","産","散","残","士","氏","史","司","試","児","治","辞","失","借","種","周","祝","順","初","松","笑","唱","焼","象","照","賞","臣","信","成","省","清","静","席","積","折","節","説","浅","戦","選","然","争","倉","巣","束","側","続","卒","孫","帯","隊","達","単","置","仲","貯","兆","腸","低","底","停","的","典","伝","徒","努","灯","堂","働","特","得","毒","熱","念","敗","梅","博","飯","飛","費","必","票","標","不","夫","付","府","副","粉","兵","別","辺","変","便","包","法","望","牧","末","満","未","脈","民","無","約","勇","要","養","浴","利","陸","良","料","量","輪","類","令","冷","例","歴","連","老","労","録","圧","移","因","永","営","衛","易","益","液","演","応","往","桜","恩","可","仮","価","河","過","賀","快","解","格","確","額","刊","幹","慣","眼","基","寄","規","技","義","逆","久","旧","居","許","境","均","禁","句","群","経","潔","件","券","険","検","限","現","減","故","個","護","効","厚","耕","鉱","構","興","講","混","査","再","災","妻","採","際","在","財","罪","雑","酸","賛","支","志","枝","師","資","飼","示","似","識","質","舎","謝","授","修","述","術","準","序","招","承","証","条","状","常","情","織","職","制","性","政","勢","精","製","税","責","績","接","設","舌","絶","銭","祖","素","総","造","像","増","則","測","属","率","損","退","貸","態","団","断","築","張","提","程","適","敵","統","銅","導","徳","独","任","燃","能","破","犯","判","版","比","肥","非","備","俵","評","貧","布","婦","富","武","復","複","仏","編","弁","保","墓","報","豊","防","貿","暴","務","夢","迷","綿","輸","余","預","容","略","留","領","異","遺","域","宇","映","延","沿","我","灰","拡","革","閣","割","株","干","巻","看","簡","危","机","揮","貴","疑","吸","供","胸","郷","勤","筋","系","敬","警","劇","激","穴","絹","権","憲","源","厳","己","呼","誤","后","孝","皇","紅","降","鋼","刻","穀","骨","困","砂","座","済","裁","策","冊","蚕","至","私","姿","視","詞","誌","磁","射","捨","尺","若","樹","収","宗","就","衆","従","縦","縮","熟","純","処","署","諸","除","将","傷","障","城","蒸","針","仁","垂","推","寸","盛","聖","誠","宣","専","泉","洗","染","善","奏","窓","創","装","層","操","蔵","臓","存","尊","宅","担","探","誕","段","暖","値","宙","忠","著","庁","頂","潮","賃","痛","展","討","党","糖","届","難","乳","認","納","脳","派","拝","背","肺","俳","班","晩","否","批","秘","腹","奮","並","陛","閉","片","補","暮","宝","訪","亡","忘","棒","枚","幕","密","盟","模","訳","郵","優","幼","欲","翌","乱","卵","覧","裏","律","臨","朗","論","乙","了","又","丈","与","及","乞","凡","刃","巾","互","丹","乏","井","冗","凶","刈","勾","匂","匹","升","厄","双","介","孔","屯","幻","弔","斗","斤","爪","牙","且","丘","丙","丼","巨","仙","凹","凸","占","叱","召","囚","奴","尻","尼","巧","払","氾","汁","込","斥","旦","玄","瓦","甘","甲","矛","伎","仰","伐","伏","充","刑","劣","匠","企","吉","叫","吐","吏","壮","如","妃","妄","尽","巡","帆","弐","忙","扱","汎","汚","汗","江","芋","芝","迅","旨","旬","肌","朽","朱","朴","缶","臼","舟","串","亜","佐","伺","伸","但","伯","伴","克","冶","励","却","即","呂","含","吟","呉","吹","呈","坑","坊","壱","妖","妥","妊","妨","妙","寿","尿","尾","岐","床","廷","弄","抗","抄","択","把","抜","扶","抑","沙","汰","沃","沖","沢","沈","没","狂","芯","芳","迎","那","邦","阪","忌","忍","戒","戻","攻","更","肘","肝","肖","杉","秀","辛","享","依","佳","侍","侮","併","免","刹","刺","到","劾","卓","叔","呪","坪","奈","奇","奉","奔","妬","姓","宛","宜","尚","屈","岡","岳","岬","弥","弦","征","彼","怪","怖","拉","押","拐","拒","拠","拘","拙","拓","抽","抵","拍","披","抱","抹","況","沼","泥","泊","泌","沸","泡","狙","苛","茎","苗","茂","迭","迫","邪","邸","阻","附","房","旺","昆","昇","股","肩","肯","肢","肪","枕","枢","析","杯","枠","欧","殴","炎","炊","炉","采","玩","祈","祉","盲","突","虎","阜","斉","亭","侶","侯","俊","侵","促","俗","冠","削","勃","勅","卑","卸","厘","叙","咽","哀","咲","垣","契","威","姻","孤","封","峡","峠","帥","帝","幽","弧","悔","恒","恨","拶","拭","括","挟","拷","挑","洪","浄","津","洞","狭","狩","茨","荒","荘","逃","郊","郎","怨","怠","怒","施","昧","是","胎","胆","胞","柿","柵","栃","架","枯","柔","柄","某","柳","為","牲","珍","甚","畏","疫","皆","盆","眉","盾","冒","砕","窃","糾","耐","臭","虐","虹","衷","訃","訂","貞","赴","軌","香","俺","倹","倒","倣","俸","倫","兼","冥","凄","准","凍","剥","剣","剛","剤","剖","匿","唄","哺","唆","唇","哲","唐","埋","娯","娠","姫","娘","宴","宰","宵","峰","徐","悦","悟","悩","挨","捉","挫","振","捜","挿","捕","浦","浸","浜","浮","涙","浪","華","逝","逐","逓","途","透","陥","陣","恣","恐","恵","恥","恋","恭","扇","拳","敏","脇","脊","脅","脂","朕","胴","桁","核","桑","栽","桟","栓","桃","殊","殉","烈","珠","祥","泰","畝","畜","畔","疾","症","疲","眠","砲","称","租","秩","袖","被","既","粋","索","紛","紡","紋","翁","耗","致","般","蚊","衰","託","貢","軒","辱","酎","酌","釜","隻","飢","鬼","竜","曹","乾","偽","偶","偵","偏","剰","勘","唾","喝","啓","唯","埼","堆","執","培","婚","婆","寂","尉","崖","崎","崇","崩","庶","庸","彩","彫","惧","惨","惜","悼","捻","捗","掛","掘","掲","控","据","措","掃","排","描","堀","淫","涯","渇","渓","渋","淑","渉","淡","添","涼","猫","猛","猟","葛","萎","菓","菊","菌","逸","逮","郭","陰","陳","陶","陪","隆","陵","患","悠","戚","斜","斬","旋","曽","脚","脱","梗","梨","殻","爽","瓶","痕","盗","眺","窒","符","粗","粘","粒","紺","紹","紳","累","羞","粛","舷","舶","虚","蛍","蛇","袋","訟","豚","貪","貫","販","赦","軟","酔","釈","釣","頃","鹿","麻","斎","亀","僅","偉","傍","募","傘","喉","喩","喚","喫","喪","圏","堪","堅","堕","塚","堤","塔","塀","塁","奥","媛","媒","婿","尋","嵐","項","幅","帽","幾","廃","廊","弾","御","循","慌","惰","愉","握","援","換");
	var a = Math.floor(Math.random() * 1500);
	


	this.draw = function(ctx) {
		ctx.beginPath();
		//ctx.rect(_this.x, _this.y, _this.size, _this.size);
		if(i%35 == 0){
			ctx.font= _this.size + "px Georgia";
		}
		if(i+1 > totalKanji){
			ctx.fillText('奏',_this.x, _this.y);
			ctx.fillStyle = 'rgba(0,0,0,1)';
		}else {
			ctx.fillText(l[a],_this.x, _this.y);
			ctx.fillStyle = 'rgba('+_this.color+', '+_this.alpha+')';
		}
		
		//ctx.fill();

	}
	
}


function loop() {
	
	ctx.clearRect(0,0,canvas.width, canvas.height);
  	
	for(var i = 0; i < kanji.length; i++) {
   		kanji[i].draw(ctx);
  	}
 	
	requestAnimationFrame(loop);
}

loop();

function randomNumber(min, max) {
   return Math.random() * (max - min) + min;
}

var longestReturnDuration = 0,
	 returnDuration = 0;

function tweenSquares(kanji) {
	
	returnDuration = 3.13;
	
	// Keep longest duration to use for delay
	if (returnDuration > longestReturnDuration) {
		longestReturnDuration = returnDuration; 
	}
	TweenMax.to(kanji, 0.7 + Math.random(), {
		x: randomNumber(0, canvas.width),  
		y: randomNumber(0, canvas.height),
		width: 20, 
		delay: longestReturnDuration + .75,
		ease: Cubic.easeInOut,
		onComplete: function() {

			TweenMax.to(kanji, longestReturnDuration, {
				x: centerX,
				y: centerY,
				width: 5, 
				ease: Quad.easeInOut,
				onComplete: function() {
					tweenSquares(kanji);
				}
			})
		}
	});
}

for (var i = 0; i < kanji.length; i++) {
	tweenSquares(kanji[i]);
}